#!/bin/bash

# Створюємо список опцій
options=("Опція 1" "Опція 2" "Опція 3" "Вихід")

# Використовуємо select для вибору
select opt in "${options[@]}"; do
    case "$opt" in
        "Опція 1")
            echo "Ви вибрали Опцію 1"
            # Тут можна виконати дії, які пов'язані з Опцією 1
            ;;
        "Опція 2")
            echo "Ви вибрали Опцію 2"
            # Тут можна виконати дії, які пов'язані з Опцією 2
            ;;
        "Опція 3")
            echo "Ви вибрали Опцію 3"
            # Тут можна виконати дії, які пов'язані з Опцією 3
            ;;
        "Вихід")
            echo "Ви вибрали Вихід."
            break
            ;;
        *) echo "Неправильний вибір";;
    esac
done
