#!/bin/bash

# Створюємо список варіантів
options=("Варіант 1" "Варіант 2" "Варіант 3" "Вихід")

# Використовуємо select для вибору
select opt in "${options[@]}"; do
    case "$opt" in
        "Варіант 1")
            echo "Ви вибрали Варіант 1"
            ;;
        "Варіант 2")
            echo "Ви вибрали Варіант 2"
            ;;
        "Варіант 3")
            echo "Ви вибрали Варіант 3"
            ;;
        "Вихід")
            echo "Ви вибрали вийти."
            break
            ;;
        *) echo "Неправильний вибір $REPLY";;
    esac
done
